POApplication/POProcessing/WSDLs/ReceivePO.wsdl

<?xml version= '1.0' encoding= 'UTF-8' ?>
<wsdl:definitions
     name="ReceivePO"
     targetNamespace="http://oracle.com/sca/soapservice/POApplication/POProcessing/ReceivePO"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
     xmlns:inp1="http://xmlns.oracle.com/ns/order"
     xmlns:tns="http://oracle.com/sca/soapservice/POApplication/POProcessing/ReceivePO"
    >
    <wsdl:types>
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://xmlns.oracle.com/ns/order" schemaLocation="../Schemas/po.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="requestMessage">
        <wsdl:part name="PORequest" element="inp1:PurchaseOrder"/>
    </wsdl:message>
    <wsdl:portType name="POProcessing">
        <wsdl:operation name="receivePO">
            <wsdl:input message="tns:requestMessage"/>
        </wsdl:operation>
    </wsdl:portType>
</wsdl:definitions>
